Examinator/src/Catalogs/УчебныеМатериалыСУО/УчебныеМатериалыСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчебныеМатериалыСУО</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Хранение</name>
    <type>
      <types>DefinedType.УчебныйМатериалСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыУчебныхМатериаловСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Размещение</name>
    <type>
      <types>EnumRef.РазмещениеУчебныхМатериаловСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Enums/РазмещениеУчебныхМатериаловСУО/РазмещениеУчебныхМатериаловСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РазмещениеУчебныхМатериаловСУО</name>
  <enumValues>
    <name>БиблиотекаЭлектронногоОбучения</name>
  </enumValues>
  <enumValues>
    <name>КонструкторКурсов</name>
  </enumValues>
  <enumValues>
    <name>КорпоративныйУниверситет</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыУчебныхМатериаловСУО/ТипыУчебныхМатериаловСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУчебныхМатериаловСУО</name>
  <enumValues>
    <name>ЗаданиеНаПроверку</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйУчебник</name>
  </enumValues>
  <enumValues>
    <name>СлайдовыйКурс</name>
  </enumValues>
  <enumValues>
    <name>Тест</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыЭлектронныхКурсов/ТипыЭлектронныхКурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭлектронныхКурсов</name>
  <enumValues>
    <name>Тест</name>
  </enumValues>
  <enumValues>
    <name>Учебник</name>
  </enumValues>
  <enumValues>
    <name>Слайдовый</name>
  </enumValues>
  <enumValues>
    <name>SCORM</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыЭлектронныхРесурсовСУЗ/ТипыЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭлектронныхРесурсовСУЗ</name>
  <enumValues>
    <name>Тест</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйКурс</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/СводыЗнанийСУЗ/СводыЗнанийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СводыЗнанийСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РуководствоПользователя</name>
      <description>Руководство пользователя</description>
    </items>
  </predefined>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательнаяНавигация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьСодержание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Глоссарий</name>
    <type>
      <types>CatalogRef.ГлоссарииСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочнаяИнформация</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПервуюСсылкуНаТермин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТерминВсплывающейПодсказкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьНепройденное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПользовательскиеНастройки</name>
    <attributes>
      <name>ВидНастройки</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыНастроекЭлектронныхРесурсовСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьПриОткрытии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.ТерминыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/УчебныеМатериалыСУО/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИспользоватьЭлектронноеОбучение = ЭлектронноеОбучение.ИспользоватьЭлектронноеОбучение();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗаданиеНаПроверкуЗаписано"
		ИЛИ ИмяСобытия = "ЭлектронныйКурсЗаписан"
		ИЛИ ИмяСобытия = "ЭлектронныйРесурсЗаписан" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Список

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Группа Тогда
		Возврат;
	КонецЕсли;
	Если Копирование И Элемент.ТекущиеДанные <> Неопределено Тогда
		Если Элемент.ТекущиеДанные.ЭтоГруппа Тогда
			Возврат;
		КонецЕсли;
		Отказ = Истина;
		Если Элемент.ТекущиеДанные.Размещение = ПредопределенноеЗначение("Перечисление.РазмещениеУчебныхМатериаловСУО.БиблиотекаЭлектронногоОбучения") Тогда
			КонтекстРедактирования = ПолучитьКонтекстРедактирования();
			РазработкаЭлектронныхКурсовКлиент.СкопироватьЭлектронныйКурс(Элемент.ТекущиеДанные.Хранение, Элементы.Список, КонтекстРедактирования);  
		КонецЕсли;
	Иначе		
		Отказ = Истина;
		ПараметрыФормы = Новый Структура("СозданиеНового", Истина);
		ОткрытьФорму("Перечисление.ТипыУчебныхМатериаловСУО.ФормаВыбора", ПараметрыФормы, Элементы.Список);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если НЕ ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;	
	КонтекстРедактирования = ПолучитьКонтекстРедактирования();	
	Если ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ТипыУчебныхМатериаловСУО.ЗаданиеНаПроверку") Тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("Владелец", ПредопределенноеЗначение("Справочник.СхемыМероприятийСУО.Общая")));
		ПараметрыФормы.Вставить("КонтекстРедактирования", КонтекстРедактирования);
		ОткрытьФорму("Справочник.ЗаданияСУО.ФормаОбъекта", ПараметрыФормы, Элементы.Список); 
	КонецЕсли;
	Если ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ТипыУчебныхМатериаловСУО.Другое") Тогда
		ВызватьИсключение НСтр("ru = 'Невозможно создать учебный материал вида ""Другое""'");
	КонецЕсли;
	Если ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ТипыУчебныхМатериаловСУО.СлайдовыйКурс") Тогда
		Если ИспользоватьЭлектронноеОбучение Тогда 
			РазработкаЭлектронныхКурсовКлиент.СоздатьЭлектронныйКурс(
				ПредопределенноеЗначение("Перечисление.ТипыЭлектронныхКурсов.Слайдовый"),
				Элементы.Список,
				КонтекстРедактирования);
		Иначе
			ВызватьИсключение НСтр("ru = 'Невозможно создать учебный материал вида ""Слайдовый курс"", так как не подключена подсистема ""Электронное обучение""'");
		КонецЕсли;
	КонецЕсли;
	Если ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ТипыУчебныхМатериаловСУО.Тест") Тогда
		Если ИспользоватьЭлектронноеОбучение Тогда
			ВызватьИсключение НСтр("ru = 'Невозможно создать учебный материал вида ""Тест"" в подсистеме ""Электронное обучение""'");
		Иначе
			ПараметрыФормы = Новый Структура; 
			ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("Тип", ПредопределенноеЗначение("Перечисление.ТипыЭлектронныхРесурсовСУЗ.Тест")));
			ПараметрыФормы.Вставить("КонтекстРедактирования", КонтекстРедактирования);
			ОткрытьФорму("Справочник.СводыЗнанийСУЗ.ФормаОбъекта", ПараметрыФормы);
		КонецЕсли;
	КонецЕсли;
	Если ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ТипыУчебныхМатериаловСУО.ЭлектронныйУчебник") Тогда
		Если ИспользоватьЭлектронноеОбучение Тогда
			РазработкаЭлектронныхКурсовКлиент.СоздатьЭлектронныйКурс(
				ПредопределенноеЗначение("Перечисление.ТипыЭлектронныхКурсов.Учебник"),
				Элементы.Список,
				КонтекстРедактирования);
		Иначе
			ПараметрыФормы = Новый Структура; 
			ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("Тип", ПредопределенноеЗначение("Перечисление.ТипыЭлектронныхРесурсовСУЗ.ЭлектронныйКурс")));
			ПараметрыФормы.Вставить("КонтекстРедактирования", КонтекстРедактирования);
			ОткрытьФорму("Справочник.СводыЗнанийСУЗ.ФормаОбъекта", ПараметрыФормы);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные = Неопределено ИЛИ Элемент.ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПоказатьЗначение(,Элемент.ТекущиеДанные.Хранение);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Функция ПолучитьКонтекстРедактирования()	
	КонтекстРедактирования = Новый Структура("Родитель", Неопределено);	
	ТекущийРодитель = Неопределено;
	Если Элементы.Список.ТекущиеДанные <> Неопределено
		И Элементы.Список.ТекущиеДанные.ЭтоГруппа Тогда
		ТекущийРодитель = Элементы.Список.ТекущиеДанные.Ссылка;
	КонецЕсли;
	Если Элементы.Список.ТекущиеДанные <> Неопределено
		И НЕ Элементы.Список.ТекущиеДанные.ЭтоГруппа Тогда
		ТекущийРодитель = Элементы.Список.ТекущиеДанные.Родитель;
	КонецЕсли;		
	КонтекстРедактирования.Родитель = ТекущийРодитель;
	Возврат КонтекстРедактирования;
КонецФункции

#КонецОбласти
